Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Выберите метод
en: Select method

source: Заменяет входное поле
en: Replaces input field

source: Добавьте выражение, чтобы можно было редактировать
en: Add expression to edit

source: Максимальная длина пароля
en: Maximum password length

source: Вы действительно хотите удалить все выражения?
en: Do you really want to delete all expressions?

source: Удаление всех выражений
en: Delete All Expressions

source: Выражение с именем {0} уже существует
en: Expression with {0} name already exists

source: Не найдено входное поле для замены выражением "{0}"
en: Input field to replace with expression "{0}" not found

source: Категории
en: Categories

source: Минимальная длина пароля
en: Minimum password length

source: Переменная
en: Variable

source: Введите код выражения
en: Enter expression code

source: Добавление выражения
en: Add Expression

source: Имя Выражения не может быть пустым
en: Expression name cannot be empty

source: Введенное имя Выражения "{0}" не является правильным идентификатором
en: The name entered for Expression "{0}" is not a valid identifier

source: Профиль политики
en: Policy preset

source: Параметры выражения
en: Expression Parameters

source: Выражение не может заменять узел-контейнер
en: Expression cannot replace container node

source: Операция не применима для узлов-выражений
en: Operation not aplicable to expression nodes

source: Добавление контейнера выражений
en: Add Expression Container

source: Имя контейнера:
en: Container name:

source: Введенное имя не является правильным идентификатором
en: The name entered is not a valid identifier

source: Узел "{0}" уже существует
en: Node "{0}" already exists

source: Не найден входной узел для замены выражением "{0}"
en: Input node to replace with expression "{0}" not found

source: Переименование контейнера выражений
en: Rename Expression Container

source: Количество специальных символов
en: Count of special characters

source: Вставка запрещена. У узла "{0}" уже существует дочерний узел с именем "{1}".
en: Insert forbidden. Node "{0}" already has a child node with name "{1}".

source: Контейнер выражений "{0}" не содержит ни одного выражения
en: Expression container "{0}" contains no expressions

source: Перейти к узлу
en: Go to Node

source: Заменяет входной узел
en: Replaces input node

source: Заменять узел
en: Replace node

source: Вставить относительное имя в выражение
en: Insert relative name into expression

source: Путь должен начинаться от корня "{0}"
en: The path should start from root "{0}"

source: Введённый путь "{0}" содержит пустое имя
en: The entered path "{0}" has an empty name

source: Введённый путь "{0}" содержит имя "{1}", не являющееся правильным идентификатором
en: The entered path "{0}" has name "{1}", which is not a valid identifier

source: Количество заглавных букв
en: Count of uppercase letters

source: Не найдена входная переменная для замены выражением "{0}"
en: Input variable to replace with expression "{0}" not found

source: Заменяет входную переменную
en: Replaces the input variable

source: Заменять переменную
en: Replace variable

source: Зависимость IV от количества классов
en: Dependence IV on Class Count

source: Количество классов
en: Class Count

source: Инф.индекс
en: IV

source: (факт)
en: (actual)

source: Начальный класс
en: Fine Class

source: Принять текущее разбиение?
en: Do you want to accept the current binning?

source: Рассчитать
en: Calculate

source: Внимание! При наличии незакрытой сессии администратора невозможно будет осуществить вход с этого же аккаунта
en: Warning: It will be impossible to log in with the same administrator account if an unclosed session is present

source: Поле '{0}' заблокировано, т.к. использует внешнее или замороженное разбиение. Снять блокировку и продолжить?
en: '{0}' field is locked due to usage of the external or locked binning. Do you want to unlock and continue?

source: Текущее разбиение содержит несохранённые изменения
en: Current binning contains unsaved changes

source: Заморозить все
en: Lock all

source: Заморозить выбранные
en: Lock selected

source: Разбить по границе
en: Bound split

source: Разморозить все
en: Unlock all

source: Разморозить выбранные
en: Unlock selected

source: Пересчитать показатели конечных классов?
en: Calculate actual coarse classes statistics?

source: Ограничение мультисессионности для администраторов
en: Restrict multisessions for admins

source: Добавить клейм
en: Add claim

source: Пересчитать
en: Calculate

source: Количества событий
en: Number of events

source: Доли событий
en: Event rates

source: Скрыть боковую панель
en: Hide side bar

source: Заморожено
en: Locked

source: Не удалось рассчитать статистику начальных и конечных классов
en: Failed to calculate fine and coarse classes statistics

source: Показать боковую панель
en: Show side bar

source: Всего
en: Total

source: Разморожено
en: Unlocked

source: Не удалось получить статистику
en: Failed to get statistics

source: Любые URL
en: Any URLs

source: Выходное поле уже задано, заменить выходное поле?
en: Target field already set. Change target field?

source: Изменение выходного поля
en: Change Target Field

source: Свертка столбцов
en: Unpivoting

source: Информационные
en: Info

source: Транспонируемые
en: Transposed

source: Отсутствует выбранный источник данных
en: No selected data source

source: Все ветви
en: All branches

source: Иначе
en: Otherwise

source: Всегда проверять сертификаты HTTPS
en: Always verify HTTPS certificates

source: Элементы "{0}" и "{1}" имеют одинаковые идентификаторы
en: "{0}" and "{1}" items have the same identifiers

source: <Уникальное имя>
en: <Unique>

source: Не задан
en: Not defined

source: Выберите поле
en: Select field

source: Вы действительно хотите удалить все условия из списка?
en: Do you really want to delete all conditions from list?

source: Удаление всех условий
en: Delete All Conditions

source: Поле "{0}" имеет количество уникальных значений {1}, в списке присутствуют только первые {2}
en: "{0}" field has {1} unique values, only the first {2} are listed

source: Нет значений
en: No values

source: Будет вычислен максимальный по модулю из коэффициентов корреляции двух процессов, рассчитанных при всевозможных временных сдвигах. Следует применять, если необходимо узнать линейную зависимость между двумя процессами или частями процессов, происходящими с некоторым временным лагом.
en: The maximum absolute value of the correlation coefficients of two processes calculated for all possible time shifts will be calculated. It should be applied if it is required to determine the linear relationship between two processes, or parts of the processes that occur with a certain time lag.

source: Всегда проверять все сертификаты
en: Always verify all certificates

source: Коэффициент ранговой корреляции Тау-b Кендалла применяется для выявления количественной взаимосвязи между переменными, если их можно ранжировать. Рекомендуется использовать для категориальных данных.
en: The Kendall's Tau-b rank correlation coefficient is used to identify the quantitative relationship between variables if they can be ranked. Use for categorical data is recommended.

source: При помощи коэффициента корреляции Пирсона можно определить силу и направление линейной зависимости между двумя процессами, происходящими одновременно.
en: Using the Pearson correlation coefficient, it is possible to determine the strength and direction of the linear relationship between two processes that occur simultaneously.

source: Коэффициент ранговой корреляции Спирмена - ещё один вариант ранговой корреляции. Для числовых полей для оценки силы связи используются не численные значения, а соответствующие им ранги. Поэтому для любых монотонных последовательностей коэффициент Спирмена будет равен 1 или -1.
en: The Spearman's rank correlation coefficient is another version of the rank correlation. Corresponding ranks, not numerical values, are used for numerical fields to estimate the connection strength. Therefore, the Spearman coefficient will be 1 or -1 for any monotone sequences.

source: Измерение в колонках для
en: Dimension in columns for

source: Кросс-таблица
en: Cross Table

source: Минимальное количество уникальных значений
en: Minimum number of unique values

source: Пропущенные
en: Null

source: Параметры приложения
en: Application parameters

source: Группа уникальных значений:
en: Group of unique values:

source: Значение для замены пропусков
en: Replace value for nulls

source: Редактирование значения замены для пропусков
en: Edit Replace Value for Nulls

source: Заменять на
en: Replace with

source: IP адрес
en: IP address

source: Глобальный индекс
en: Global index

source: Таблица в переменные
en: Table to Variables

source: Сопоставление полей для формирования XML
en: Mapping Fields to Form XML

source: Параметры компонента
en: Component parameters

source: Обычный
en: Common

source: Значение для выброса должно быть меньше, чем для экстремального значения
en: The outlier value must be less than the one for the extreme value

source: ЕМ Кластеризация
en: EM Clustering

source: Введите текст команды
en: Enter command text

source: Узлы в текущем модуле
en: Nodes in the current module

source: Параметры подключения
en: Connection parameters

source: Нельзя задать ссылку на узел "{0}", для которого невозможно наследование
en: Failed to set reference to "{0}" node for which inheritance is not possible

source: Целевой компонент удален.
en: Target component deleted.

source: Целевой компонент "{0}" удален.
en: "{0}" target component deleted.

source: Целевой компонент не найден, возможно, он был удален или стал недоступен.
en: Target component was not found, it may have been deleted or became unavailable.

source: Целевой компонент "{0}" не найден, возможно, он был удален или стал недоступен.
en: "{0}" target component was not found, it may have been deleted or became unavailable.

source: Выполнение узла
en: Node Execution

source: Не выбран целевой компонент.
en: No target component selected.

source: Целевой компонент "{0}" не выделен. Превышен предел {1} загружаемых уровней узлов.
en: "{0}" target component is not selected. The limit {1} of loaded node levels has been exceeded.

source: Значения границ интервала
en: Interval Boundaries

source: Нижняя граница
en: Lower bound

source: Верхняя граница
en: Upper bound

source: Выбор периода
en: Select Time Span

source: Значение временного промежутка
en: Time span value

source: Тип временного промежутка
en: Time span unit

source: Выберите столбец
en: Select column

source: Деактивация групп узлов по завершении
en: Deactivate node groups on completion

source: Поле указано не верно
en: Field is specified incorrectly

source: и ещё {0}
en: and {0} more

source: Отменено пользователем
en: Canceled by user

source: ИЛИ
en: OR

source: Редактировать клейм
en: Edit claim

source: Вводимое значение должно быть уникальным
en: The value you enter must be unique

source: Превышен максимальный объём вставляемых данных. Допустимо не более {0} символов.
en: Maximum data volume for pasting exceeded. No more than {0} characters allowed.

source: Список значений
en: Value List

source: Загрузка изображений запрещена
en: Loading images is not allowed

source: Запятая с пробелом (,␣)
en: Comma with space (,␣)

source: Настройки варианта агрегации "Список"
en: Configure "List" aggregation option

source: Разделитель
en: Separator

source: Ограничитель строк
en: Text qualifier

source: Методы агрегации для {0}:
en: Aggregation methods for {0}:

source: Не заданы методы агрегации
en: No aggregation methods specified

source: Не определен
en: Not defined

source: Формирование ссылок запрещено
en: Generating links is not allowed

source: Группу
en: Group

source: Показатели
en: Parameters

source: Группировка
en: Grouping

source: Перенос строки Windows (CRLF)
en: New line Windows (CRLF)

source: Перенос строки Linux (LF)
en: New line Linux (LF)

source: Без разделителя
en: No separator

source: Без сортировки
en: No sorting

source: Без ограничителя строк
en: No text qualifier

source: Кавычки (")
en: Quotes (")

source: Точка с запятой (;)
en: Semicolon (;)

source: Папки
en: Folders

source: Точка с запятой с пробелом (;␣)
en: Semicolon with space (;␣)

source: Одинарные кавычки (')
en: Single quotes (')

source: Пробел (␣)
en: Space (␣)

source: Табуляция (⭾)
en: Tab (⭾)

source: Только уникальные
en: Unique only

source: Введите код
en: Enter script

source: Настройка столбцов выходных таблиц JavaScript
en: Configure JavaScript Output Table Columns

source: Настройка столбцов выходной таблицы JavaScript
en: Configure JavaScript Output Table Columns

source: Разность включает в результат все строки из главного набора данных, за исключением строк, для которых ключевые поля главного (левого) и вычитаемого (правого) набора данных совпадают.
en: The difference includes all rows from the main dataset into result, with the exception of the rows for which the key fields of the main (left) and subtracted (right) datasets coincide.

source: Полное внешнее соединение включает в результат все строки из главного и присоединяемого наборов данных. Если ключевые поля совпадают, то строки заполняются реальными значениями. В несовпадающих строках столбцы заполняются значениями null.
en: Full outer join includes all rows from the main and joining datasets into result. If the key fields match, then the rows are filled in with real values. Columns are filled in with the null values in mismatched rows.

source: Запрет мультисессионности для пользователей
en: Disable user multisessions

source: Внутреннее соединение включает в результат все строки, для которых найдено совпадение ключевых полей главного и присоединяемого наборов данных.
en: The inner join includes into result all rows for which a match has been found for the key fields of the main and joining datasets.

source: Настройка слияния данных
en: Configure Data Joining

source: Столбцы присоединяемого набора данных
en: Columns of joining dataset

source: Внешнее левое соединение включает в результат все строки из главного набора данных, дополненные значениями столбцов из присоединяемого набора данных, которые совпадают по ключевым полям.
en: The outer left join includes into result all rows from the main dataset, supplemented by the column values from the joining dataset that coincide in the key fields.

source: Столбцы основного набора данных
en: Main dataset columns

source: Внешнее правое соединение включает в результат все строки из присоединяемого набора данных, дополненные значениями столбцов из главного набора данных, которые совпадают по ключевым полям.
en: The outer right join includes into result all rows from the joining dataset supplemented by the column values from the main dataset that coincide in the key fields.

source: массив
en: array

source: контейнер
en: container

source: Имя JSON поля
en: JSON field name

source: Лимит попыток ввода пароля
en: Password entry attempts limit

source: Строгая проверка соответствия входного JSON структуре выходного дерева
en: Strong check when mapping input JSON to output tree structure

source: Детальная настройка линейной регрессии
en: Detailed configuring of linear regression

source: Настройка линейной регрессии
en: Linear regression configuring

source: Генеральное
en: General

source: Детальная настройка логистической регрессии
en: Detailed configuring of logistic regression

source: Настройка логистической регрессии
en: Logistic regression configuring

source: Обучающее
en: Train

source: Отсутствует переменная в связи входной переменной "{0}" с выходной "{1}"
en: No variable in link of "{0}" input variable with "{1}" output variable

source: Сопоставление переменных
en: Mapping Variables

source: Тайм-аут ввода пароля (сек)
en: Password entry timeout (s)

source: Выходные переменные
en: Output Variables

source: Входные переменные
en: Input Variables

source: Выбор узла цикла
en: Loop Node Selection

source: Определять автоматически
en: Autodetect

source: Отсутствует назначенная для группировки колонка "{0}"
en: No "{0}" column assigned for grouping

source: Значение не может быть меньше
en: Value cannot be lower

source: Отсутствует входной порт источника данных для групповой обработки
en: No data source input port for batch processing

source: Отсутствует исходный компонент
en: No source component

source: Отсутствует переменная "{0}"
en: No "{0}" variable

source: все
en: all

source: Средняя
en: Mean

source: Сильная
en: Strong

source: Очень сильная
en: Very strong

source: Слабая
en: Weak

source: Настройка столбцов выходных таблиц Python
en: Configure Python Output Tables Columns

source: Настройка столбцов выходной таблицы Python
en: Configure Python Output Table Columns

source: символов stderr пропущено
en: stderr characters omitted

source: пользователь
en: user

source: символов stdout пропущено
en: stdout characters omitted

source: Кэширование
en: Caching

source: Настройка параметров полей
en: Configure Field Features

source: преобразовано из
en: transformed from

source: пользователь и группа
en: user and group

source: Вы действительно хотите удалить все варианты замен?
en: Do you really want to remove all replacement items?

source: Удалить таблицу замен
en: Delete Replacement Table

source: Включите замену для редактирования
en: Include replacement to edit

source: Выберите замену для редактирования
en: Select replacement to edit

source: Элемент не является полем для загрузки файла
en: Item is not file upload field

source: Не выбран файл
en: No file selected

source: Невозможно привести значение {0} к типу данных {1}
en: Failed to cast Value {0} to {1} data type

source: Размер файла превышает максимально допустимый {0}. Файл будет обрабатываться слишком долго.
en: File size exceeds allowable maximum {0}. File processing will take too long.

source: Выходные значения будут переменного типа, если не заменить остальные
en: Output values will be related to the variant type without replacement of others

source: Точное совпадение
en: Exact match

source: Тайм-аут закрытия сессии (сек)
en: Session disconnection timeout (s)

source: Клеймы
en: Claims

source: Неизвестный уровень логирования: {0}
en: Unknown logging level: {0}

source: Текст сообщения
en: Message body

source: Параметр имеет недопустимый тип данных: {0}
en: The parameter has an invalid data type: {0}

source: Пример
en: Example

source: HTTP Метод:
en: HTTP Method:

source: Далее приводится пример текста запроса Json:
en: The following is an example request Json body:

source: MCP tool с именем {0} уже существует
en: MCP tool with the {0} name already exists

source: Далее приводится Json схема запроса:
en: The following is the request Json Schema:

source: Далее приводится пример текста ответа Json:
en: The following is an example response Json body:

source: Далее приводится Json схема ответа:
en: The following is the response Json Schema:

source: Данная страница описывает конечные точки веб-сервиса.
en: This page describes the endpoints of this web service.

source: Конечные точки в {0}
en: Endpoints at {0}

source: Направление сообщения
en: Message direction

source: Метод
en: Method

source: Н/Д
en: No data available

source: Служба в {0}
en: Service at {0}

source: Ссылка на {0}
en: Reference for {0}

source: При инициализации сервиса возникло исключение
en: Exception occurred during the service initialization

source: Данная страница описывает операции службы в этой конечной точке.
en: This page describes the service operations at this endpoint.

source: Операции в {0}
en: Operations at {0}

source: Запрос
en: Request

source: Тело запроса - пустое.
en: The request body is empty.

source: Ответ
en: Response

source: Схема
en: Schema

source: Пример URL:
en: URL example:

source: Формат URL:
en: URL format:

source: Запуск сервиса, версия: {0}
en: Service start, version: {0}

source: На сервере {0} добавлен опубликованный пакет "{1}" версии "{2}"
en: The published package "{1}" of the version "{2}" has been added on the server {0}

source: На сервере {0} изменен опубликованный пакет "{1}" версии "{2}"
en: The published package "{1}" of version "{2}" has been changed on server {0}

source: На сервере {0} изменен список опубликованных пакетов
en: The published packages list changed on {0} server

source: Выполнено подключение к серверу {0}
en: Connected to server {0}

source: На сервере {0} удален опубликованный пакет "{1}" версии "{2}"
en: The published package "{1}" of version "{2}" was deleted on server {0}

source: Атрибут address или unixsocket должен быть определен
en: address or unixsocket attribute must be defined

source: Не удалось отменить обработку пакета "{0}", выполнение узла с идентификатором {1}
en: Failed to cancel processing of package "{0}", execution of node with {1} identifier

source: Пакет "{1}" версии "{2}", принадлежащий серверу {0}, не может быть опубликован: {3}
en: "{1}" package of "{2}" version related to {0} server cannot be published: {3}

source: Не удалось подключиться к серверу {0}
en: {0} server connection failed

source: Потеряно соединение с сервером {0}
en: {0} server connection lost

source: Сервис остановлен
en: Service stopped

source: пакет отличается от уже опубликованного пакета с тем же именем и версией
en: the package does not match the previously published package with the same name and version

source: пакет содержит более одного узла с именем "{0}"
en: the package contains more than one node with "{0}" name

source: не задано имя узла с меткой "{0}" и идентификатором {{{1}}}
en: no node name with "{0}" caption and {{{1}}} identifier specified

source: Во время обработки запроса было потеряно соединение с сервером {0}
en: {0} server connection lost during request processing

source: "{0}" не является допустимым пространством имён
en: "{0}" is an invalid namespace

source: Ошибка загрузки пакетов для сервера {0}
en: Error in loading of packages for {0} server

source: Не найдено ни одного сервера, на котором доступен пакет "{0}" версии "{1}"
en: No server found on which "{0}" package of "{1}" version is available

source: узел с именем "{0}" уже существует в пакете "{1}" версии "{2}"
en: node with "{0}" name already exists in "{1}" package of "{2}" version

source: Нет ни одного работающего сервера, на котором доступен пакет "{0}" версии "{1}"
en: No functioning server found on which "{0}" package of "{1}" version is available

source: у входного порта узла {0} не задано имя, при этом порт не является единственным
en: the input port node {0} has unspecified name and the port is not single

source: Остановка сервиса
en: Service stop

source: у выходного порта узла {0} не задано имя, при этом порт не является единственным
en: no name specified for the output port of the {0} node and the port is not single

source: пакет не содержит ни одного опубликованного узла
en: The package contains no published nodes

source: Ошибка сохранения пакетов для сервера {0}
en: Error of saving of packages for {0} server

source: Ошибка отключения от сервера {0}
en: Error of disconnection from {0} server

source: Атрибут unixsocket должен быть определен
en: unixsocket attribute must be defined

source: Ошибка обновления пакетов для сервера {0}
en: Error of package update for {0} server

source: Обработка запроса на сервере {0}
en: Processing the request on server {0}

source: На сервере {0} восстановлена публикация пакета "{1}" версии "{2}", который больше не конфликтует с другими пакетами
en: Publication of package "{1}" (version "{2}") restored on server {0}. The package does not conflict with other packages any more

source: Url вызываемого метода: {0}
en: Url of called method: {0}

source: Не задано ни одного столбца для логирования
en: No column specified for logging
